In [1]:
import pandas as pd

In [5]:
!type C:\Users\lenovo\Downloads\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [10]:
df = pd.read_csv("C:/Users/lenovo/Downloads/ex1.csv")

In [11]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
pd.read_table("C:/Users/lenovo/Downloads/ex1.csv", sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
!type C:\Users\lenovo\Downloads\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [14]:
pd.read_csv("C:/Users/lenovo/Downloads/ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [16]:
pd.read_csv("C:/Users/lenovo/Downloads/ex2.csv", names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
pd.read_csv("C:/Users/lenovo/Downloads/ex2.csv", names=['a', 'b', 'c', 'd', 'message'], index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [18]:
!type C:\Users\lenovo\Downloads\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [19]:
parsed = pd.read_csv("C:/Users/lenovo/Downloads/csv_mindex.csv", index_col=['key1','key2'])

In [20]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [21]:
list(open("C:/Users/lenovo/Downloads/ex3.txt"))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [22]:
result = pd.read_table("C:/Users/lenovo/Downloads/ex3.txt", sep='\s+')

In [23]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [24]:
!type C:\Users\lenovo\Downloads\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [26]:
pd.read_csv("C:/Users/lenovo/Downloads/ex4.csv", skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [27]:
!type C:\Users\lenovo\Downloads\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [28]:
result = pd.read_csv("C:/Users/lenovo/Downloads/ex5.csv")

In [29]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [30]:
dic = {'message': ['foo', 'NA'], 'something':['two']}

In [31]:
pd.read_csv("C:/Users/lenovo/Downloads/ex5.csv", na_values=dic)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [32]:
pd.options.display.max_rows = 10

In [33]:
result = pd.read_csv("C:/Users/lenovo/Downloads/ex6.csv")

In [34]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [35]:
pd.read_csv("C:/Users/lenovo/Downloads/ex6.csv", nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [38]:
chunker = pd.read_csv("C:/Users/lenovo/Downloads/ex6.csv", chunksize=1000)

In [39]:
chunker

In [40]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

In [41]:
tot = tot.sort_values(ascending=False)

In [42]:
tot[:10]

key
E    368
X    364
L    346
O    343
Q    340
M    338
J    337
F    335
K    334
H    330
dtype: object

In [43]:
data = pd.read_csv("C:/Users/lenovo/Downloads/ex5.csv")

In [44]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [45]:
data.to_csv("C:/Users/lenovo/Downloads/out.csv")

In [48]:
!type C:\Users\lenovo\Downloads\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [50]:
dates = pd.date_range('1/1/2000', periods=7)

In [52]:
import numpy as np

In [53]:
ts = pd.Series(np.arange(7), index=dates)

In [54]:
ts.to_csv("C:/Users/lenovo/Downloads/tseries.csv")

In [55]:
!type C:\Users\lenovo\Downloads\tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [56]:
!type C:\Users\lenovo\Downloads\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [57]:
import csv

In [58]:
f = open("C:/Users/lenovo/Downloads/ex7.csv")

In [59]:
reader = csv.reader(f)

In [60]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [61]:
with open("C:/Users/lenovo/Downloads/ex7.csv") as f:
    lines = list(csv.reader(f))

In [62]:
header, values = lines[0], lines[1:]

In [63]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [64]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [65]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [66]:
import json

In [67]:
result = json.loads(obj)

In [68]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [70]:
asjson = json.dumps(result)

In [71]:
df = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [72]:
df

    name  age
0  Scott   30
1  Katie   38

In [73]:
!type C:\Users\lenovo\Downloads\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [74]:
data = pd.read_json("C:/Users/lenovo/Downloads/example.json")

In [75]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [76]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [77]:
tables = pd.read_html("C:/Users/lenovo/Downloads/fdic_failed_bank_list.html")

In [78]:
len(tables)

1

In [79]:
failures = tables[0]

In [80]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [82]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [83]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, Length: 15, dtype: int64

In [84]:
from lxml import objectify

In [85]:
path = "C:/Users/lenovo/Downloads/Performance_MNR.xml"

In [86]:
parsed = objectify.parse(open(path))

In [87]:
root = parsed.getroot()

In [89]:
frame = pd.read_csv("C:/Users/lenovo/Downloads/ex1.csv")

In [90]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [91]:
frame.to_pickle("C:/Users/lenovo/Downloads/framepickle")

In [92]:
pd.read_pickle("C:/Users/lenovo/Downloads/framepickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [95]:
xlsx = pd.ExcelFile("C:/Users/lenovo/Downloads/ex1.xlsx")

In [96]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [99]:
frame.to_excel("C:/Users/lenovo/Downloads/ex1.xlsx")